; domain
;; Rockets domain: A logistic-like domain.
;; However, rockets can only fly once (they run out of fuel).
;; In problems rrt4 and rrt5 some passengers have to transit
;; several times to get to their destination.

(define (domain rocket)
  (:requirements :strips)
  (:predicates (cargo ?x) (rocket ?x) (location ?x)
	       (at ?t ?l) (in ?c ?r) (fuel ?r) (loaded ?r) (visited ?r ?l)
)

  (:action load
   :parameters (?c ?r ?l)
   :precondition (and (cargo ?c) (rocket ?r) (location ?l)
		      (at ?c ?l) (at ?r ?l) (not (loaded ?r)))
   :effect (and (not (at ?c ?l)) (in ?c ?r) (loaded ?r)))

  (:action unload
   :parameters (?c ?r ?l)
   :precondition (and (cargo ?c) (rocket ?r) (location ?l)
		      (in ?c ?r) (at ?r ?l) (loaded ?r))
   :effect (and (not (in ?c ?r)) (at ?c ?l) (not (loaded ?r))))

  (:action fly
   :parameters (?r ?dep ?dst)
   :precondition (and (rocket ?r) (location ?dep) (location ?dst)
		      (at ?r ?dep) (fuel ?r) (not (visited ?r ?dst)))
   :effect (and (not (at ?r ?dep)) (at ?r ?dst) (not (fuel ?r)) (visited ?r ?dst)))
   
  (:action fuelUp
   :parameters (?r ?dep)
   :precondition (and (rocket ?r) (location ?dep)
		      (at ?r ?dep) (not (fuel ?r)) (not (loaded ?r)))
   :effect (and (fuel ?r)))
)

; problem
(define (problem rocket_1_3_3)
  (:domain rocket)
  (:requirements :strips)
  (:objects
	r0
	c0
	c1
	c2
	l0
	l1
	l2
	  )
  (:init
	(at r0 l0)
	
	(rocket r0)
	(cargo c0)
	(cargo c1)
	(cargo c2)
	(location l0)
	(location l1)
	(location l2)
	
	(at c1 l1)
	(at c2 l2)
	(at c0 l0)
	  )
  (:goal (and 
	(at c1 l0)
	(at c2 l1)
	(at c0 l2)
	  )
  )
)

; plan
1. (fuelup r0 l0)
   added: (fuel r0)
   goals met: 0 of 3
2. (load c0 r0 l0)
   deleted: (at c0 l0)
   added: (in c0 r0) (loaded r0)
   goals met: 0 of 3
3. (fly r0 l0 l2)
   deleted: (at r0 l0) (fuel r0)
   added: (at r0 l2) (visited r0 l2)
   goals met: 0 of 3
4. (unload c0 r0 l2)
   deleted: (in c0 r0) (loaded r0)
   added: (at c0 l2)
   goals met: 1 of 3
5. (fuelup r0 l2)
   added: (fuel r0)
   goals met: 1 of 3
6. (load c2 r0 l2)
   deleted: (at c2 l2)
   added: (in c2 r0) (loaded r0)
   goals met: 1 of 3
7. (fly r0 l2 l1)
   deleted: (at r0 l2) (fuel r0)
   added: (at r0 l1) (visited r0 l1)
   goals met: 1 of 3
8. (unload c2 r0 l1)
   deleted: (in c2 r0) (loaded r0)
   added: (at c2 l1)
   goals met: 2 of 3
9. (fuelup r0 l1)
   added: (fuel r0)
   goals met: 2 of 3
10. (load c1 r0 l1)
   deleted: (at c1 l1)
   added: (in c1 r0) (loaded r0)
   goals met: 2 of 3
11. (fly r0 l1 l0)
   deleted: (at r0 l1) (fuel r0)
   added: (at r0 l0) (visited r0 l0)
   goals met: 2 of 3
12. (unload c1 r0 l0)
   deleted: (in c1 r0) (loaded r0)
   added: (at c1 l0)
   goals met: 3 of 3
